In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/neerajprasad209/Dataset/main/50_Startups.csv")

In [2]:
df.head()

         RND      ADMIN        MKT       STATE     PROFIT
0  165349.20  136897.80  471784.10    New York  192261.83
1  162597.70  151377.59  443898.53  California  191792.06
2  153441.51  101145.55  407934.54     Florida  191050.39
3  144372.41  118671.85  383199.62    New York  182901.99
4  142107.34   91391.77  366168.42     Florida  166187.94

# Question 1: List any five functions of the pandas library with execution.

## Answer:

## 1:  info() function - This method is used to generate the summary of the DataFrame, this will include info about columns with their names, their datatypes, and missing values.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RND     50 non-null     float64
 1   ADMIN   50 non-null     float64
 2   MKT     50 non-null     float64
 3   STATE   50 non-null     object
 4   PROFIT  50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

## 2: isnull() Function - Returns the DataFrame/Series of the boolean values. Missing values gets mapped to True and non-missing value gets mapped to False.

In [4]:
# Using head to see the top 5 values in the data frame
df.isnull().head()

     RND  ADMIN    MKT  STATE  PROFIT
0  False  False  False  False   False
1  False  False  False  False   False
2  False  False  False  False   False
3  False  False  False  False   False
4  False  False  False  False   False

## 3: value_counts() Function - Returns the counts of the unique values in a series or from a dataframeâ€™s column

In [5]:
df['STATE'].value_counts()

New York      17
California    17
Florida       16
Name: STATE, dtype: int64

## 4: describe() function - This function is used to generate descriptive statistics for a DataFrame, such as count, mean, standard deviation, minimum, and maximum.

In [6]:
# Using .T to transpose the dataset below for better understanding
df.describe().T

,count,mean,std,min,25%,50%,75%,max
RND,50.0,73721.6156,45902.256482,0.00,39936.3700,73051.080,101602.8000,165349.20
ADMIN,50.0,121344.6396,28017.802755,51283.14,103730.8750,122699.795,144842.1800,182645.56
MKT,50.0,211025.0978,122290.310726,0.00,129300.1325,212716.240,299469.0850,471784.10
PROFIT,50.0,112012.6392,40306.180338,14681.40,90138.9025,107978.190,139765.9775,192261.83

## 5: nunique() - This function in Pandas is used to get a count of unique values for each column in a DataFrame. It returns a Pandas Series containing the number of unique values for each column in the DataFrame.

In [7]:
df.nunique()

RND       49
ADMIN     50
MKT       48
STATE      3
PROFIT    50
dtype: int64

# Question 2: Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.


## Answer.

In [8]:
# Creating the coustom fumction for generating the dataframe as mentioned.

def reindex_df(df):
    new_index = range(1, len(df)+1, 2) 
    df = df.reindex(new_index)
    
    return df

In [9]:
# creating tht Dataframe 
df = pd.DataFrame({"A": ['U','V','W','X','Y','Z'], "B": [True,False,True,False,False,True], "C": [1,2,3,4,5,6]})

In [10]:
#Printing the dataframe
df

   A      B  C
0  U   True  1
1  V  False  2
2  W   True  3
3  X  False  4
4  Y  False  5
5  Z   True  6

In [11]:
df_reindex = reindex_df(df)

In [12]:
df_reindex

   A      B  C
1  V  False  2
3  X  False  4
5  Z   True  6

# Question 3: You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.


## Answer:

In [13]:
# Creating the data frame 
df = pd.DataFrame({"Values": [10,20,30,40,50]})

In [14]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [15]:
# Creating the function to sum the Fitst 3 numbers 
def sum_df(df):
    value = df['Values'].values # getting the column as array 
    result = sum(value[:3]) # adding the first 3 values
    print(f'Sum of first 3 no of dataframe is : {result}')

In [16]:
sum_df(df)

Sum of first 3 no of dataframe is : 60

# Question 4: Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

## Answer:

In [17]:
df = pd.DataFrame({'Text': ['My name is Neeraj', 'This is Data Science Course']})

In [18]:
df

                          Text
0            My name is Neeraj
1  This is Data Science Course

In [19]:
def add_word(df):
    def count_word(text):
        return len(text.split())
    df["Word Count"] = df['Text'].apply(count_word)
    
    return df

In [20]:
add_word(df)

                          Text  Word Count
0            My name is Neeraj           4
1  This is Data Science Course           5

# Question 5: How are DataFrame.size() and DataFrame.shape() different?

## Answer:

### Both DataFrame.size and DataFrame.shape are attributes of a Pandas DataFrame, but they return different values.

### 1. DataFrame.size returns the total number of elements in the DataFrame, which is the product of the number of rows and columns. It is equivalent to the size of the underlying NumPy array.

### 2. DataFrame.shape returns a tuple containing the number of rows and columns in the DataFrame, respectively. It is a convenient way to check the dimensions of the DataFrame.

### Here's an example that demonstrates the difference between DataFrame.size and DataFrame.shape:

In [21]:
# Create a simple Dataframe with 2 row and column.
df = pd.DataFrame({"A": [1,2],"B": [3,4],"C": [5,6]})
df

   A  B  C
0  1  3  5
1  2  4  6

In [22]:
df.size

6

In [23]:
df.shape

(2, 3)

# Question 6: Which function of pandas do we use to read an excel file?

## Answer: 

### To read an Excel file in Pandas, we can use the read_excel() function. This function is part of the Pandas IO tools and can read data from Excel files with various extensions like .xlsx, .xls, and .xlsm.

In [24]:
df = pd.read_excel('Example.xlsx')

In [25]:
df

   Employee_id       Name  Designation
0          101     Neeraj    Developer
1          102     Diksha    Architect
2          103       Alka  QA (Tester)
3          104      Krish   Operations
4          105  Sudhanshu      Manager

## Question 7 : You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

## The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username'column.

In [26]:
df = pd.DataFrame({'email': ['neeraj@example.com', 'diksha@test.com', 'aadi.prasad@rediff.com', 'mohan.more@apple.com']})

In [27]:
df

                    email
0      neeraj@example.com
1         diksha@test.com
2  aadi.prasad@rediff.com
3    mohan.more@apple.com

In [28]:
def add_username(df):
    def split_username(email):
        return email.split('@')[0]
    df['Username'] = df['email'].apply(split_username)
    
    return df

In [29]:
add_username(df)

                    email     Username
0      neeraj@example.com       neeraj
1         diksha@test.com       diksha
2  aadi.prasad@rediff.com  aadi.prasad
3    mohan.more@apple.com   mohan.more

# Question 8: You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. Thefunction should return a new DataFrame that contains only the selected rows.

## For example, if df contains the following values:

|     | A   | B   | C   |
|:---:|:---:|:---:|:---:|
|0    |3    |5    |1    |
|1    |8    |2    |7    |
|2    |6    |9    |4    |
|3    |2    |3    |5    |
|4    |9    |1    |2    |

## Your function should select the following rows

|     | A   | B   | C   |
|:---:|:---:|:---:|:---:|
|1    |8    |2    |7    |
|4    |9    |1    |2    |



## Answer:

In [30]:
df = pd.DataFrame({"A": [3,8,6,2,9], "B": [5,2,9,3,1], "C": [1,7,4,5,2]})

In [31]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
def select_rows(df):
    mask = (df["A"]>5) & (df["B"]<10)
    
    df_new = df[mask].copy()
    
    return df_new

In [33]:
new_df = select_rows(df)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Please Note that row 2 also satisfies the condition hence the function is selecting it

# Question 9 : Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.


## Answer:

In [34]:
df = pd.DataFrame({"Values": [11,12,13,14,15,16]})
df

   Values
0      11
1      12
2      13
3      14
4      15
5      16

In [35]:
def calcuate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    
    return mean, median, std_dev

In [36]:
mean, median, std_dev = calcuate_stats(df)

print(f"Mean of values is : {mean}")
print(f"Median of values is : {median}")
print(f"Standard Deviation of values is : {std_dev}")

Mean of values is : 13.5
Median of values is : 13.5
Standard Deviation of values is : 1.8708286933869707

# Question 10 : Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day

In [37]:
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
    'Sales': [11, 15, 35, 41, 42, 64, 72, 51, 65, 81, 95, 111]
})

In [38]:
df

          Date  Sales
0   2022-01-01     11
1   2022-01-02     15
2   2022-01-03     35
3   2022-01-04     41
4   2022-01-05     42
5   2022-01-06     64
6   2022-01-07     72
7   2022-01-08     51
8   2022-01-09     65
9   2022-01-10     81
10  2022-01-11     95
11  2022-01-12    111

In [39]:
def calculate_mov_avg(df):
    
    df = df.sort_values(by='Date')
    
    df["MovingAverage"] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

In [40]:
data = calculate_mov_avg(df)

data

          Date  Sales  MovingAverage
0   2022-01-01     11      11.000000
1   2022-01-02     15      13.000000
2   2022-01-03     35      20.333333
3   2022-01-04     41      25.500000
4   2022-01-05     42      28.800000
5   2022-01-06     64      34.666667
6   2022-01-07     72      40.000000
7   2022-01-08     51      45.714286
8   2022-01-09     65      52.857143
9   2022-01-10     81      59.428571
10  2022-01-11     95      67.142857
11  2022-01-12    111      77.000000

# Question 11: You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.

|     |Date      |
|:---:|:--------:|
|0    |2023-01-01|
|1    |2023-01-02|
|2    |2023-01-03|
|3    |2023-01-04|
|4    |2023-01-05|

## Your function should create the following DataFrame:

|     |Date      |Weekday  |
|:---:|:--------:|:-------:|
|0    |2023-01-01|Sunday   |  
|1    |2023-01-02|Monday   |
|2    |2023-01-03|Tuesday  |
|3    |2023-01-04|Wednesday|
|4    |2023-01-05|Thursday |

## The function should return the modified DataFrame.



## Answer:

In [41]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [42]:
def weekdays_text(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    df['Weekday'] =df['Date'].dt.day_name()
    
    return df

In [43]:
df_new = weekdays_text(df)
df_new

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Question 12 :Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

## Answer:

In [46]:
df = pd.DataFrame({"Date": pd.date_range(start='12/1/2022', end='3/1/2023',freq='D')})
df

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28
90 2023-03-01

[91 rows x 1 columns]

In [48]:
def selection_month(df):
    df["Date"] = pd.to_datetime(df["Date"])
    
    jan_row = df[df["Date"].between('2023-01-01', '2023-01-31')]
    
    return jan_row

In [49]:
selection_month(df)

         Date
31 2023-01-01
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30
61 2023-01-31

# Question 13: To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

## Answer : 

### The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself. You can import pandas using the following statement:

### This statement imports the pandas library and gives it an alias pd, which is a common convention in the Python community. With this import statement, you can then use all the basic functions of pandas such as creating a DataFrame, manipulating data within a DataFrame, and performing various types of analyses and transformations on the data.

In [52]:
import pandas as pd